{
    "header": {
        "home": "Inicio",
        "experience": "Experiencia profesional",
        "projects": "Proyectos realizados"
    },
    "pages": {
        "home": {
            "studies_tag": "Máximo grado de estudios",
            "studies_res": "Licenciatura en Ingeniería Mecatrónica",
            "phone_tag": "Número de celular",
            "joel_title": "Ingeniero en Mecatrónica | Desarrollador de Software",
            "info_1": "Al estudiar mi carrera, desarrollé un gusto especial por todo lo relacionado al software. Realicé mis prácticas profesionales en CFE (organismo del gobierno) desarrollando una aplicación web para el análisis de datos.            Más adelante construí una aplicación web destinada a consultorios médicos como parte de mi tesis profesional.",
            "info_2": "Gracias a mi gusto por la programación y mi constante interés en perseguir una carrera al respecto, hoy en día soy un ingeniero con más de dos años de experiencia en el desarrollo de software.",
            "goodbye": "Contáctame si tienes alguna duda"
        },
        "projects":{
            "aclaration": "Debido a acuerdos de No-divulgación, no puedo mostrar el código de mis proyectos realizados en Infosys ni hablar sobre los clientes con los que he trabajado. La siguiente información corresponde a proyectos personales que demuestran mis habilidades"
        }
    },
    "experience": {
        "CFE": {
            "company": "Comisión Federal de Electricidad",
            "role": "Programador Junior",
            "time": "[6 meses] - ENE - JUN 2020",
            "type": "Prácticas profesionales",
            "content": "Desarrollé de una aplicación web con PHP para la automatización de un análisis de datos mensual. El Departamento de Contratos Legados analizaba documentos con cerca de 4000 registros manualmente en el plazo de una o más semanas. Gracias a mi solución, la tarea se redujo a menos de diez minutos."
        },
        "INFOSYS": {
            "company": "Infosys",
            "role": "Systems Engineer",
            "time": "[2 años] - MAR 2022 - MAR 2024",
            "type": "Empleado remoto",
            "content": "Infosys es una empresa de consultoría IT internacional. Me involucré en un ambiente de negocios en inglés con equipos globalmente distribuidos, trabajando bajo la metodología Scrum.",
            "bullets":[
                "Participé en desarrollo back-end con Java - Spring Boot y Python - FastAPI",
                "Participé en desarrollo front-end con Typescript - AngularJS",
                "Participé en diseño de base de datos(MySQL) y estuve encargado del catálogo de metadatos",
                "Realicé Test Driven Development con JUnit y Mockito",
                "Participé en un proyecto de migración de servidores y base de datos. Implementé ETL pipelines con Python, Airflow, Kafka y Spark. Además, estuve involucrado en Amazon Web Services (CloudWatch y Lambda)"
            ]
        }
    },
    "projects": {
        "resume": {
            "to": "Sobre esta página web",
            "title": "Curriculum online hecho con ReactJS",
            "source": "Proyecto personal",
            "content": "Desarrollé esta web como prueba de mis habilidades y para mostrar mis otros proyectos"
        },
        "cfe": {
            "to": "Dirigido a trabajadores de la CFE",
            "title": "Aplicación web de análisis de datos",
            "source": "Proyecto parte de mis prácticas profesionales",
            "content": "Desarrollé de una aplicación web con PHP para la automatización de un análisis de datos mensual realizado por el Departamento de Contratos Legados. Se trata de una aplicación con arquitectura MVC que lee y genera archivos csv/xlsx con información filtrada según lo que pida el usuario. Tiene Administradores, Usuarios, control de contraseñas y una interfaz amigable realizada con Boostrap."
        },
        "lishor": {
            "to": "Dirigido a quien sea que desee tener su propio Acortador de Links",
            "title": "Acortador de Links",
            "source": "Proyecto personal",
            "content": "Desarrollé de una aplicación web con ExpressJS + Typescript para acortar links. Está dockerizada y lista para usar. Mi objetivo personal era aplicar todos los conceptos profesionales de desarrollo que he adquirido en Infosys (TDD, Arquitectura por capas, Programación Orientada a Objetos, Data Transfer Objects, Error Handling, etc...)"
        },
        "davel": {
            "to": "Dirigido a un escritor",
            "title": "Blog de Wordpress para escritor",
            "source": "Proyecto personal",
            "content": "Desarrollé un Wordpress theme para un escritor. Tiene estilos personalizados y creación de publicaciones especializadas (Libros). Visite la página web para ver el trabajo final."
        },
        "letras": {
            "to": "Dirigido a escritores",
            "title": "Aplicación web para el procesamiento de textos",
            "source": "Proyecto personal",
            "content": "Desarrollé una aplicación web dirigida a escritores. Su objetivo es contabilizar y formatear texto con una interfaz amigable. Visite la página web para ver el trabajo final."
        }
        
    },
    "langs": {
        "language": "Lenguaje",
        "es": "Español",
        "en": "Inglés",
        "ja": "Japonés"
    },
    "gral": {
        "visit_repo": "Visita este repositorio",
        "tech_used": "Tecnologías usadas"
    }
}