{
    "header": {
        "home": "Hōmu",
        "experience": "Shokumu Keireki",
        "projects": "Purojekuto"
    },
    "pages": {
        "home": {
            "studies_tag": "Saikō Gakui",
            "studies_res": "Mekatoronikusu Kōgaku no Gakushigō",
            "phone_tag": "Denwa Bangō",
            "joel_title": "Mekatoronikusu Enjinia | Kaihatsusha",
            "info_1": "Gakugyō no katei de, Sofutowea kanren no bun'ya ni tokubetsu na kyōmi o mochimashita. CFE (seifu kikan) de no senmon no intānshippu de wa, Dēta Bunseki no tame no Web apurikēshon o kaihatsu shimashita. Nochi ni, senmon ronbun no ichi'kan to shite, iryō kurinikku muke no Web apurikēshon o kōchiku shimashita.",
            "info_2": "Puroguramingu e no jōnetsu to kono ryōiki de no kyaria o tsuiseki suru fukutsu no doryoku ni yotte, watashi wa ima ya Sofutowea enjinia to shite 2-nen ijō no keiken o atsumemashita.",
            "goodbye": "Otoiawase ga aru baai wa okigaru ni go renraku kudasai."
        },
        "projects": {
            "aclaration": "Hikai hoketsu no tame, Infosys de okonatta purojekuto no kōdo o hyōji shitari, toriatsukatta kuraianto ni tsuite hanashitari suru koto wa dekimasen. Kōko no jōhō wa, watashi no sukiru o shimesu kojin purojekuto ni kansuru mono desu."
        }
    },
    "experience": {
        "CFE": {
            "company": "Comisión Federal de Electricidad",
            "role": "Junia Puroguramā",
            "time": "[6 kagetsu] - 2020-nen 1-gatsu - 6-gatsu",
            "type": "Senmon Intānshippu",
            "content": "Watashi wa, tsukijigatsu de EPHP de Web apurikēshon o kaihatsu shimashita. Isan keiyaku bu no shiryō wa, hotondo 4000-rekōdo no dokyumento o 1-shūkan ijō kakete, tezukuri de bunseki shite imashita. Watashi no soryūshon no okage de, sono tāsuku wa 10-fun ijō ni shōshō saremashita."
        },
        "INFOSYS": {
            "company": "Infosys",
            "role": "Shisutemu Enjinia",
            "time": "[2-nen] - 2022-nen 3-gatsu - 2024-nen 3-gatsu",
            "type": "Rimōto Enjinpōi",
            "content": "Infosys wa kokusai-tekina IT konsarutingu kaishadesu. Watashi wa, sukuramu shuhō nimotozuite, sekaijū ni bunsan shita chīmu to eigo de bijinesu kankyō ni tazusawaru koto ni narimashita.",
            "bullets": [
                "Java - Spring Boot o shiyō shita bakkuendo kaihatsu ni kōken shimashita",
                "Typescript - AngularJS o shiyō shita furontoendo kaihatsu ni kōken shimashita",
                "Dētabēsu sekkei (MySQL) ni sanka shi, metadēta katarogu o tantō shimashita",
                "JUnit oyobi Mockito o shiyō shita tesuto doraibun kaihatsu o jisshō shimashita",
                "Sābā to dētabēsu no ikan, ikaihen purojekuto ni kankaishimashita. Python, Airflow, Kafka, Spark o shiyō shita ETL pairain o jissō shimashita. Mata, Amazon Web Services (CloudWatch to Lambda) ni kankaishimashita."
            ]
        }
    },
    "projects": {
        "resume": {
            "to": "Kono Webu Saito ni tsuite",
            "title": "ReactJS de Tsukurareta Onrain Rirekisho",
            "source": "Kojin Purojekuto",
            "content": "Kono Webu Saito wa, watashi no sukiru o shōmei shi, hoka no purojekuto o shōkai suru tame ni kaihatsu sare mashita."
        },
        "cfe": {
            "to": "CFE no jigyōsha muke",
            "title": "Dēta Bunseki Webu Apurikēshon",
            "source": "Senmon Intānshippu no ichi'kan toshite no purojekuto",
            "content": "Watashi wa, isan keiyaku bu ga tsukijigatsu no dēta bunseki o jidōka suru tame ni PHP de Web apurikēshon o kaihatsu shimashita. Yūzā no yōkyū ni ōjite jōhō o furutāringu shi, csv/xlsx fairu o yomi komi, shikendekitara sakusei suru MVC kōzō no apurikēshon desu. Adominisutorētā, yūzā, pasuwādo kontorōru, Būtsutorappu de tsukurareta shiyōyasui intāfeisu ga fukumarete imasu."
        },
        "lishor": {
            "to": "Rinku Tanshuku ga hitsuyō na kata muke",
            "title": "Rinku Tanshuku Sābisu",
            "source": "Kojin Purojekuto",
            "content": "Watashi wa, Rinku no tanshuku o okonau tame ni ExpressJS + Typescript de Web apurikēshon o kaihatsu shimashita. Dokkāka sarete orimasu. Watashi no kojinteki na mokuteki wa, Infosys de shūtoku shita subete no purofesshonarudeberomento no kontseputo (TDD, Reiyādo ākitekucha, Oubujekuto-shi, Dēta Toraansufā Obujekuto, Erā Handaringu, nado) o tekiyō suru koto deshita."
        },
        "davel": {
            "to": "Sakka muke",
            "title": "Sakka-yō no Wordpress Burogu",
            "source": "Kojin Purojekuto",
            "content": "Watashi wa, Sakka no tameno Wordpress tēma o kaihatsu shimashita. Kasutamu sutairu to senmon no sōkō no sakusei (Hon) ga tokuchō desu. Webu saito o hōmon shite saishū sagyō o goran kudasai."
        },
        "letras": {
            "to": "Sakka muke",
            "title": "Tekisuto Shori Webu Apurikēshon",
            "source": "Kojin Purojekuto",
            "content": "Watashi wa, sakka o taishō to shita Webu apurikēshon o kaihatsu shimashita. Sono mokuteki wa, yūzāfurīndorī intāfeisu de tekisuto o kōkei shi, keisan suru koto desu. Webu saito o hōmon shite saishū sagyō o goran kudasai."
        }
    },
    "langs": {
        "language": "Gengo",
        "es": "Supein-go",
        "en": "Eigo",
        "ja": "Nihongo"
    },
    "gral": {
        "visit_repo": "Kono Repositorio o hōmon suru",
        "tech_used": "Tsukatta Gijutsu"
    }
}